In [2]:
import warnings
warnings.simplefilter('ignore')

## Import pandas libraries and  numpy

In [3]:
import numpy as np
import pandas as pd

### Data visualization library

In [4]:
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

### Import dataset

In [5]:
dataset =pd.read_excel('C:/Users/abishek/Documents/Abishek_DATA SCIENCE/Dataset/student_dataset.xlsx')

In [6]:
dataset.head()

   S.NO  ATTN  THEORY  Daily assn  TOTAL  certificate
0     1    20      38          25     83  DISTINCTION
1     2    15      25           0     40   COMPLETION
2     3    20      31          25     76  FIRST CLASS
3     4    20      25          25     70  FIRST CLASS
4     5    20      17          15     52  FIRST CLASS

## dataset shape

In [7]:
dataset.shape

(367, 6)

In [8]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 367 entries, 0 to 366
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   S.NO         367 non-null    int64
 1   ATTN         367 non-null    int64
 2   THEORY       367 non-null    int64
 3   Daily assn   367 non-null    int64
 4   TOTAL        367 non-null    int64
 5   certificate  367 non-null    object
dtypes: int64(5), object(1)
memory usage: 17.3+ KB

In [9]:
dataset.isnull().sum()

S.NO           0
ATTN           0
THEORY         0
Daily assn     0
TOTAL          0
certificate    0
dtype: int64

In [10]:
dataset.describe()

             S.NO        ATTN      THEORY  Daily assn       TOTAL
count  367.000000  367.000000  367.000000  367.000000  367.000000
mean   184.000000   18.926431   12.495913   13.405995   41.231608
std    106.088014    3.607450   12.815605    9.770943   21.568883
min      1.000000    1.000000    0.000000    0.000000    0.000000
25%     92.500000   15.000000    0.000000    0.000000   25.000000
50%    184.000000   20.000000   12.000000   15.000000   40.000000
75%    275.500000   20.000000   24.000000   25.000000   57.500000
max    367.000000   25.000000   42.000000   25.000000   87.000000

In [11]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 367 entries, 0 to 366
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   S.NO         367 non-null    int64
 1   ATTN         367 non-null    int64
 2   THEORY       367 non-null    int64
 3   Daily assn   367 non-null    int64
 4   TOTAL        367 non-null    int64
 5   certificate  367 non-null    object
dtypes: int64(5), object(1)
memory usage: 17.3+ KB

In [12]:
data=dataset.drop(['S.NO','TOTAL'],axis=1)

In [13]:
data

     ATTN  THEORY  Daily assn    certificate
0      20      38          25    DISTINCTION
1      15      25           0     COMPLETION
2      20      31          25    FIRST CLASS
3      20      25          25    FIRST CLASS
4      20      17          15    FIRST CLASS
..    ...     ...         ...            ...
362    15       0          10  PARTICIPATION
363    20       9          25     COMPLETION
364    15      20          25    FIRST CLASS
365    15       0          10  PARTICIPATION
366    20      23          10     COMPLETION

[367 rows x 4 columns]

## get unique value

In [14]:
data['certificate'].unique()

array(['DISTINCTION', 'COMPLETION', 'FIRST CLASS', 'PARTICIPATION'],
      dtype=object)

### groupby function used to group the typpe of certificate and size is total number is printed

In [15]:
data.groupby('certificate').size()

certificate
COMPLETION       117
DISTINCTION       32
FIRST CLASS       66
PARTICIPATION    152
dtype: int64

### Encoding the data

In [16]:
from sklearn.preprocessing import LabelEncoder

In [17]:
data.iloc[:,3] = LabelEncoder().fit_transform(data.iloc[:,3])

In [18]:
data

     ATTN  THEORY  Daily assn certificate
0      20      38          25           1
1      15      25           0           0
2      20      31          25           2
3      20      25          25           2
4      20      17          15           2
..    ...     ...         ...         ...
362    15       0          10           3
363    20       9          25           0
364    15      20          25           2
365    15       0          10           3
366    20      23          10           0

[367 rows x 4 columns]

In [19]:
x = data.iloc[:,:-1].values

In [20]:
x

array([[20, 38, 25],
       [15, 25,  0],
       [20, 31, 25],
       ...,
       [15, 20, 25],
       [15,  0, 10],
       [20, 23, 10]])

In [21]:
type(x)

numpy.ndarray